app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "This is neatsdfds"], ["updated_at", "2018-10-13 22:07:08.248839"], ["id", 4]]
---
  def update
    #@comment = @commentable.comments.find(params[:id])
    @comment = Comment.find(params[:id])
    if @comment.update(comment_params)

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "This is nice"], ["commentable_id", 4], ["commentable_type", "Comment"], ["created_at", "2018-10-13 22:15:04.379851"], ["updated_at", "2018-10-13 22:15:04.379851"]]
---
  def create
    @comment = @commentable.comments.new comment_params

    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_commentable
    @commentable = Comment.find_by_id(params[:comment_id]) if params[:comment_id]
    @commentable = Post.find_by_id(params[:post_id]) if params[:post_id]