app/controllers/posts_controller.rb

  def create
    if user_signed_in?
      @post = current_user.posts.new(post_params)
    else
      @post = Post.new(post_params)
    end

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "img", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "img" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["img", "http://www.pngall.com/wp-content/uploads/2016/03/Troll-Face-Meme-PNG.png"], ["updated_at", "2018-10-12 21:15:39.476168"], ["id", 6]]